#include <iostream>
using namespace  std;
int main() {
	setlocale(LC_ALL, "rus");
//Integer1◦Дано расстояние L в сантиметрах.Используя операцию деления нацело, найти количество полных метров в нем(1 метр = 100 см).
//	int l, m;
//	cin >> l;
//	 m = l / 100;
//	cout <<"целых метров"<< m << endl;
//Integer2◦Дана масса M в килограммах.Используя операцию деления нацело, найти количество полных тонн в ней(1 тонна = 1000 кг).
//	int m, t;
//	cin >> m;
//	t = m / 1000;
//	cout <<целых тонн"<< t << endl;
//Integer3◦Дан размер файла в байтах.Используя операцию деления нацело, найти количество полных килобайтов, которые занимает данный файл
//(1 килобайт = 1024 байта).
//	int  b, k;
//	cin >> b;
//	k = b / 1024;
//	cout <<"целых килобайтов"<< k << endl;
//Integer4◦Даны целые положительные числа A и B(A > B).На отрезке длины A размещено максимально возможное количество отрезков длины B
//(без наложений).Используя операцию деления нацело, найти количество отрезков B, размещенных на отрезке A.
//	int a, b;
//	cin >> a >> b;
//	b = a / b;
//	cout << b << endl;
//Integer5◦Даны целые положительные числа A и B(A > B).На отрезке длины A размещено максимально возможное количество отрезков длины B(без наложений 
//Используя операцию взятия остатка от деления нацело, найти длину незанятой части отрезка A.
//	int a, b, c;
//	cin >> a >> b;
//	b = a / b;
//	c = a % b;
//	cout << b << c << endl;
//Integer6◦Дано двузначное число.Вывести вначале его левую цифру(десятки), а затем — его правую цифру(единицы).Для нахождения десятков
//использовать операцию деления нацело, для нахождения единиц — операцию взятия остатка от деления.
//	int a, b, c;
//	cin >> a;
//	b = a / 10;
//	cout << b << endl;
//	c = a % 10;
//	cout << c << endl;
//Integer7◦Дано двузначное число.Найти сумму и произведение его цифр.
//	int a, b, c, res, res2;
//	cin >> a;
//	b = a / 10;
//	c = a % 10;
//	res = b + c;
//	res2 = b * c;
//	cout << res << endl;
//	cout << res2 << endl;
//Integer8◦Дано двузначное число.Вывести число, полученное при перестановке цифр исходного числа.
//	int a, b, c, res, res2;
//	cin >> a;
//	b = a / 10;
//	c = a % 10;
//	res = 10 * c + b;
//	cout << res << endl;
//Integer9◦Дано трехзначное число.Используя одну операцию деления нацело,вывести первую цифру данного числа(сотни)
//	int a, b;
//	cin >> a;
//	b = a / 100;
//	cout << b << endl;
//Integer10◦Дано трехзначное число.Вывести вначале его последнюю цифру(единицы), а затем — его среднюю цифру(десятки).
//	int a, b, c, d;
//	cin >> a;
//	d = a % 100;
//	b = d % 10;
//	c = d / 10;
//	cout << b << endl;
//	cout << c << endl;
//Integer11◦Дано трехзначное число.Найти сумму и произведение его цифр.
//	int a, b, d, c, res, res2;
//	cin >> a;
//	b = a % 10;
//	c = (a % 100) / 10;
//	d = a / 100;
//	res = c + b + d;
//	res2 = d * b * c;
//	cout << res << endl;
//	cout << res2 << endl;
//Integer12◦Дано трехзначное число.Вывести число, полученное при прочтении исходного числа справа налево.
//	int a, b, c, d;
//	cin >> a;
//	b = a % 10;
//	c = (a % 100) / 10;
//	d = a / 100;




	return 0;
}